Tshapecase_case1/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (1 0 0)     //0
    (2 0 0) //1
    (0 1 0) //2
    (1 1 0) //3
    (2 1 0) //4
    (3 1 0) //5

    (0 2 0) //6
    (1 2 0) //7
    (2 2 0) //8
    (3 2 0) //9

    (1 0 0.1)     //10
    (2 0 0.1) //1
    (0 1 0.1) //2
    (1 1 0.1) //3
    (2 1 0.1) //4
    (3 1 0.1) //5

    (0 2 0.1) //6
    (1 2 0.1) //7
    (2 2 0.1) //8
    (3 2 0.1) //9

);

blocks
(
    hex (0 1 4 3 10 11 14 13) (15 15 1) simpleGrading (1 1 1)
    hex (2 3 7 6 12 13 17 16) (15 15 1) simpleGrading (1 1 1)
    hex (3 4 8 7 13 14 18 17) (15 15 1) simpleGrading (1 1 1)
    hex (4 5 9 8 14 15 19 18) (15 15 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 11 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 7 17 16)
            (7 8 18 17)
            (8 9 19 18)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 13 10)//left
            (2 3 13 12)
            (2 6 16 12)

            (1 4 14 11)//right
            (4 5 15 14)
            (5 9 19 15)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)//back
            (2 3 7 6)
            (3 4 8 7)
            (4 5 9 8)

            (10 11 14 13)//front
            (12 13 17 16)
            (13 14 18 17)
            (14 15 19 18)
        );
    }
);


// ************************************************************************* //
